In [1]:
import pandas as pd

In [2]:
# 读取本地数据
df = pd.read_csv('uk_rain_2014.csv', header=0)

In [3]:
# OB 一手
df.head()

,Water Year,Rain (mm) Oct-Sep,Outflow (m3/s) Oct-Sep,Rain (mm) Dec-Feb,Outflow (m3/s) Dec-Feb,Rain (mm) Jun-Aug,Outflow (m3/s) Jun-Aug
0,1980/81,1182,5408,292,7248,174,2212
1,1981/82,1098,5112,257,7316,242,1936
2,1982/83,1156,5701,330,8567,124,1802
3,1983/84,993,4265,391,8905,141,1078
4,1984/85,1182,5364,217,5813,343,4313

In [4]:
# 有多少行
len(df)

33

In [5]:
# 设置列名
df.columns = ['water_year','rain_octsep', 'outflow_octsep',
              'rain_decfeb', 'outflow_decfeb', 'rain_junaug', 'outflow_junaug']

In [6]:
type(df.columns)

pandas.core.indexes.base.Index

In [7]:
# 判断某一个字符串是否在列名中
'1111' not in df.columns

True

In [8]:
# 再 OB
df.head()

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
0,1980/81,1182,5408,292,7248,174,2212
1,1981/82,1098,5112,257,7316,242,1936
2,1982/83,1156,5701,330,8567,124,1802
3,1983/84,993,4265,391,8905,141,1078
4,1984/85,1182,5364,217,5813,343,4313

In [9]:
# 列名转成 list，看它怎么说
cols = list(df.columns)

In [10]:
# 操作列名 list
cols[-1] = 'nice'
cols

['water_year',
 'rain_octsep',
 'outflow_octsep',
 'rain_decfeb',
 'outflow_decfeb',
 'rain_junaug',
 'nice']

In [11]:
# 把 list 直接给列名
df.columns = cols
df.columns

Index(['water_year', 'rain_octsep', 'outflow_octsep', 'rain_decfeb',
       'outflow_decfeb', 'rain_junaug', 'nice'],
      dtype='object')

In [67]:
# 修改某个值
df.at[0, 'rain_octsep'] = 111
df.head()

   stat_key  word  rain_octsep
0         5   6.0        111.0
1         7   8.0          NaN

In [13]:
# 再次OB
df.tail()

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,nice
28,2008/09,1139,4941,268,6690,323,3189
29,2009/10,1103,4738,255,6435,244,1958
30,2010/11,1053,4521,265,6593,267,2885
31,2011/12,1285,5500,339,7630,379,5261
32,2012/13,1090,5329,350,9615,187,1797

In [14]:
# 提取一列为 series（）
# dataframe 是 series 的字典（k 为数字或字符，v是series）
df['water_year']

0     1980/81
1     1981/82
2     1982/83
3     1983/84
4     1984/85
5     1985/86
6     1986/87
7     1987/88
8     1988/89
9     1989/90
10    1990/91
11    1991/92
12    1992/93
13    1993/94
14    1994/95
15    1995/96
16    1996/97
17    1997/98
18    1998/99
19    1999/00
20    2000/01
21    2001/02
22    2002/03
23    2003/04
24    2004/05
25    2005/06
26    2006/07
27    2007/08
28    2008/09
29    2009/10
30    2010/11
31    2011/12
32    2012/13
Name: water_year, dtype: object

In [15]:
# 不用空格和 - 命名的好处，可以用点运算
df.water_year

0     1980/81
1     1981/82
2     1982/83
3     1983/84
4     1984/85
5     1985/86
6     1986/87
7     1987/88
8     1988/89
9     1989/90
10    1990/91
11    1991/92
12    1992/93
13    1993/94
14    1994/95
15    1995/96
16    1996/97
17    1997/98
18    1998/99
19    1999/00
20    2000/01
21    2001/02
22    2002/03
23    2003/04
24    2004/05
25    2005/06
26    2006/07
27    2007/08
28    2008/09
29    2009/10
30    2010/11
31    2011/12
32    2012/13
Name: water_year, dtype: object

In [16]:
# 行标签可以是 数字型、字符型
# 数字型：用iloc
df.iloc[0]

water_year        1980/81
rain_octsep          1182
outflow_octsep       5408
rain_decfeb           292
outflow_decfeb       7248
rain_junaug           174
nice                 2212
Name: 0, dtype: object

In [17]:
# 把某列名作为行索引
df = df.set_index(['water_year'])

In [18]:
df.head()

,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,nice
water_year,,,,,,
1980/81,1182,5408,292,7248,174,2212
1981/82,1098,5112,257,7316,242,1936
1982/83,1156,5701,330,8567,124,1802
1983/84,993,4265,391,8905,141,1078
1984/85,1182,5364,217,5813,343,4313

In [19]:
df.tail()

,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,nice
water_year,,,,,,
2008/09,1139,4941,268,6690,323,3189
2009/10,1103,4738,255,6435,244,1958
2010/11,1053,4521,265,6593,267,2885
2011/12,1285,5500,339,7630,379,5261
2012/13,1090,5329,350,9615,187,1797

In [20]:
# 用字符型得到行数据
df.loc['2000/01']

rain_octsep       1239
outflow_octsep    6092
rain_decfeb        328
outflow_decfeb    9347
rain_junaug        236
nice              2142
Name: 2000/01, dtype: int64

In [21]:
df.loc['2008/09']

rain_octsep       1139
outflow_octsep    4941
rain_decfeb        268
outflow_decfeb    6690
rain_junaug        323
nice              3189
Name: 2008/09, dtype: int64

In [22]:
df = df.reset_index('water_year')

In [23]:
df.head()

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,nice
0,1980/81,1182,5408,292,7248,174,2212
1,1981/82,1098,5112,257,7316,242,1936
2,1982/83,1156,5701,330,8567,124,1802
3,1983/84,993,4265,391,8905,141,1078
4,1984/85,1182,5364,217,5813,343,4313

In [24]:
def base_year(year):
    base_year = year[:4]
    base_year= pd.to_datetime(base_year).year
    return base_year

In [25]:
df['water_year'] = df.water_year.apply(base_year)

In [26]:
df.head()

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,nice
0,1980,1182,5408,292,7248,174,2212
1,1981,1098,5112,257,7316,242,1936
2,1982,1156,5701,330,8567,124,1802
3,1983,993,4265,391,8905,141,1078
4,1984,1182,5364,217,5813,343,4313

In [27]:
df.rain_junaug.min()

103

In [28]:
df.rain_junaug.max()

379

In [29]:
df.rain_junaug.mean()

237.4848484848485

In [30]:
import numpy as np
df1 = pd.DataFrame(np.random.randn(6,4), columns=list('ABCD'))

In [31]:
df1

          A         B         C         D
0 -1.981468 -0.651816  0.680901  1.951085
1  1.736912 -0.687660 -0.737397  1.496578
2  0.243747  1.163595  0.301342  0.644384
3  1.741799 -0.221157 -0.588573  0.547173
4  0.624126 -0.744703 -1.524600 -0.177833
5 -0.237847 -1.022140 -0.953400  0.827697

In [32]:
df1['A'].iloc[1] = np.nan

In [33]:
df1

          A         B         C         D
0 -1.981468 -0.651816  0.680901  1.951085
1       NaN -0.687660 -0.737397  1.496578
2  0.243747  1.163595  0.301342  0.644384
3  1.741799 -0.221157 -0.588573  0.547173
4  0.624126 -0.744703 -1.524600 -0.177833
5 -0.237847 -1.022140 -0.953400  0.827697

In [34]:
df1['B'].iloc[1] = 111

In [35]:
df1['E'] = [1,2,4,5,5,4]
df1

          A           B         C         D  E
0 -1.981468   -0.651816  0.680901  1.951085  1
1       NaN  111.000000 -0.737397  1.496578  2
2  0.243747    1.163595  0.301342  0.644384  4
3  1.741799   -0.221157 -0.588573  0.547173  5
4  0.624126   -0.744703 -1.524600 -0.177833  5
5 -0.237847   -1.022140 -0.953400  0.827697  4

In [36]:
df3 = df1.drop('B', axis=1)
df3

          A         C         D  E
0 -1.981468  0.680901  1.951085  1
1       NaN -0.737397  1.496578  2
2  0.243747  0.301342  0.644384  4
3  1.741799 -0.588573  0.547173  5
4  0.624126 -1.524600 -0.177833  5
5 -0.237847 -0.953400  0.827697  4

In [37]:
df1.iloc[2]['B'] = 222
df1.head()

/Users/icearl/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

          A           B         C         D  E
0 -1.981468   -0.651816  0.680901  1.951085  1
1       NaN  111.000000 -0.737397  1.496578  2
2  0.243747    1.163595  0.301342  0.644384  4
3  1.741799   -0.221157 -0.588573  0.547173  5
4  0.624126   -0.744703 -1.524600 -0.177833  5

In [38]:
df1.iloc[1]['B']

111.0

In [39]:
df1

          A           B         C         D  E
0 -1.981468   -0.651816  0.680901  1.951085  1
1       NaN  111.000000 -0.737397  1.496578  2
2  0.243747    1.163595  0.301342  0.644384  4
3  1.741799   -0.221157 -0.588573  0.547173  5
4  0.624126   -0.744703 -1.524600 -0.177833  5
5 -0.237847   -1.022140 -0.953400  0.827697  4

In [40]:
df.columns

Index(['water_year', 'rain_octsep', 'outflow_octsep', 'rain_decfeb',
       'outflow_decfeb', 'rain_junaug', 'nice'],
      dtype='object')

In [41]:
col_names = df.columns.values
col_names

array(['water_year', 'rain_octsep', 'outflow_octsep', 'rain_decfeb',
       'outflow_decfeb', 'rain_junaug', 'nice'], dtype=object)

In [42]:
type(col_names)

numpy.ndarray

In [43]:
col_names.tolist()

['water_year',
 'rain_octsep',
 'outflow_octsep',
 'rain_decfeb',
 'outflow_decfeb',
 'rain_junaug',
 'nice']

In [44]:
np.zeros(shape=(5,2))

array([[0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

In [45]:
stat_fields = ['nice', 'dfldfd','gogod']
index = ['min', 'max', 'mean']
length = len(stat_fields)
stat_summary_df = pd.DataFrame(np.zeros(shape=(3,length)), index = index, columns = stat_fields)
stat_summary_df

      nice  dfldfd  gogod
min    0.0     0.0    0.0
max    0.0     0.0    0.0
mean   0.0     0.0    0.0

In [46]:
# 另一种创建 df 的方式
df2 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                        columns=list('ABCD'))
df2

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [47]:
pd.DataFrame([[1, '中国', 1]], columns = ['stat_key', 'word', 'count'])

   stat_key word  count
0         1   中国      1

In [48]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['stat_key', 'word'])
df2

   stat_key  word
0         5     6
1         7     8

In [49]:
df2

   stat_key  word
0         5     6
1         7     8

In [50]:
df = df2

In [51]:
df

   stat_key  word
0         5     6
1         7     8

In [52]:
a = df['word'].iloc[0]
a

6

In [53]:
type(a)

numpy.int64

In [54]:
df['word'] = df['word'].astype('float64')

In [55]:
df

   stat_key  word
0         5   6.0
1         7   8.0

In [56]:
type(df['word'])

pandas.core.series.Series

In [57]:
df.index.is_unique

True

In [58]:
index = [1, 2, 3]
df2 = pd.DataFrame([[5, 6, 11], [7, 8, 22], [7, 8, 33]], index = index, columns = ['a', 'b', 'id'])
df2

   a  b  id
1  5  6  11
2  7  8  22
3  7  8  33

In [59]:
df.join(df2)

   stat_key  word    a    b    id
0         5   6.0  NaN  NaN   NaN
1         7   8.0  5.0  6.0  11.0

In [60]:
df2.join(df)

   a  b  id  stat_key  word
1  5  6  11       7.0   8.0
2  7  8  22       NaN   NaN
3  7  8  33       NaN   NaN

In [61]:
index = [1, 2, 3]
df3 = pd.DataFrame([[10, 20, 11], [70, 80, 22], [70, 80, 33]], index = index, columns = ['w', 'c', 'id'])
df3

    w   c  id
1  10  20  11
2  70  80  22
3  70  80  33

In [62]:
df3.join(df2)

ValueError: columns overlap but no suffix specified: Index(['id'], dtype='object')

In [ ]:
df3.index.get_duplicates()

In [ ]:
df2

In [ ]:
df3

In [ ]:
from scipy.sparse import csr_matrix
sdf2 = pd.SparseDataFrame(csr_matrix(np.zeros((len(df2), 0))), index=df2['id'])
sdf2

In [ ]:
sdf1 = pd.SparseDataFrame(df2['id'].to_sparse(), index=df2.index)
sdf1

In [ ]:
s3 = df3.to_sparse()
print 's3',s3
print 'df2', df2
sdf3 = pd.SparseDataFrame(s3, index=df2['id'])
sdf3

In [ ]:
sdf2 = sdf2.join(sdf3)
sdf2

In [ ]:
index = [1, 2, 2]
df4 = pd.DataFrame([[5, 6], [7, 8], [4, 3]], index = index, columns = ['a', 'b'])

In [ ]:
df4

In [ ]:
index = [0, 2, 2]
df5 = pd.DataFrame([[5, 6], [7, 8], [4, 3]], index = index, columns = ['a', 'b'])

In [ ]:
df5

In [ ]:
sdf4 = pd.SparseDataFrame(csr_matrix(np.zeros((len(df4), 0))), index=df4.index)
sdf4

In [ ]:
sdf5 = pd.SparseDataFrame(df5, columns = df5.columns, index=df3['id'])
sdf5

In [ ]:
sdf5.set_index(df3['id'])